wms_mobile/src/DataProcessors/ДиспетчерЗадач/ДиспетчерЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДиспетчерЗадач</name>
</mdclass:DataProcessor>

wms_mobile/src/Documents/итПриемка/итПриемка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итПриемка</name>
  <posting>Deny</posting>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучательПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПомарочныйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеФизическогоНосителя</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеПомарочногоУчета</name>
    <attributes>
      <name>SSCC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Марка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

wms_mobile/src/Documents/итРазмещение/итРазмещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итРазмещение</name>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихКодыЯчеекДокумента</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

wms_mobile/src/Documents/итПеремещение/итПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итПеремещение</name>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихКодыЯчеекДокумента</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

wms_mobile/src/Documents/итКонтрольнаяАгрегация/итКонтрольнаяАгрегация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итКонтрольнаяАгрегация</name>
  <posting>Deny</posting>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>АгрегированиеПоНаборке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеДокументаКСканированию</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтроковоеПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатурыСтроковоеПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатурыПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеСканированияДокумента</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатурыПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

wms_mobile/src/Documents/итНаборка/итНаборка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итНаборка</name>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаборки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>155</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FSRARID</name>
    <comment>ид для печати SSCC</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйПризнак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесНаборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОчередьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихКодыЯчеекДокумента</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

wms_mobile/src/Documents/итЗадачиИнвентаризации/итЗадачиИнвентаризации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итЗадачиИнвентаризации</name>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихКодыЯчеекДокумента</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

wms_mobile/src/Documents/итОтгрузка/итОтгрузка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итОтгрузка</name>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктураКраткогоСодежимого</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихКодыЯчеекДокумента</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

wms_mobile/src/DataProcessors/ДиспетчерЗадач/Forms/МоиЗадачиОбщийСписок/Module.bsl
&НаКлиенте
Процедура СписокЗадачВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//ОткрытьЗначение(Элемент.ТекущиеДанные.ДокументОснование);
Если  ТипЗнч(Элемент.ТекущиеДанные.ДокументОснование) = тип("ДокументСсылка.итПриемка") тогда
	ОткрытьФорму("Документ.итПриемка.Форма.ФормаДокумента",новый Структура("Ключ",Элемент.ТекущиеДанные.ДокументОснование),ЭтаФорма);
КонецЕсли;
Если ТипЗнч(Элемент.ТекущиеДанные.ДокументОснование) = тип("ДокументСсылка.итРазмещение") тогда
	ОткрытьФорму("Документ.итРазмещение.Форма.ФормаЗадачиДокумента",новый Структура("Ключ,ИдЗадачи",Элемент.ТекущиеДанные.ДокументОснование,Элемент.ТекущиеДанные.ИдЗадачи),ЭтаФорма);
КонецЕсли;
Если ТипЗнч(Элемент.ТекущиеДанные.ДокументОснование) = тип("ДокументСсылка.итПеремещение") тогда
	ОткрытьФорму("Документ.итПеремещение.Форма.ФормаЗадачиДокумента",новый Структура("Ключ,ИдЗадачи",Элемент.ТекущиеДанные.ДокументОснование,Элемент.ТекущиеДанные.ИдЗадачи),ЭтаФорма);
КонецЕсли;
Если ТипЗнч(Элемент.ТекущиеДанные.ДокументОснование) = тип("ДокументСсылка.итКонтрольнаяАгрегация") тогда
	ОткрытьФорму("Документ.итКонтрольнаяАгрегация.Форма.ФормаДокумента",новый Структура("Ключ,ИдЗадачи",Элемент.ТекущиеДанные.ДокументОснование),ЭтаФорма);
КонецЕсли;
Если ТипЗнч(Элемент.ТекущиеДанные.ДокументОснование)=Тип("ДокументСсылка.итНаборка") тогда
	ОткрытьФорму("Документ.итНаборка.Форма.ФормаДокумента",новый Структура("Ключ",Элемент.ТекущиеДанные.ДокументОснование),ЭтаФорма);
КонецЕсли;
Если ТипЗнч(Элемент.ТекущиеДанные.ДокументОснование)=Тип("ДокументСсылка.итЗадачиИнвентаризации") тогда
	ОткрытьФорму("Документ.итЗадачиИнвентаризации.Форма.ФормаДокумента",новый Структура("Ключ",Элемент.ТекущиеДанные.ДокументОснование),ЭтаФорма);
КонецЕсли;
Если ТипЗнч(Элемент.ТекущиеДанные.ДокументОснование)=Тип("ДокументСсылка.итОтгрузка") тогда
	ОткрытьФорму("Документ.итОтгрузка.Форма.ФормаДокумента",новый Структура("Ключ",Элемент.ТекущиеДанные.ДокументОснование),ЭтаФорма);
КонецЕсли;
Если ТипЗнч(Элемент.ТекущиеДанные.ДокументОснование)=Тип("ДокументСсылка.итПроверка") тогда
	ОткрытьФорму("Документ.итПроверка.Форма.ФормаДокумента",новый Структура("Ключ",Элемент.ТекущиеДанные.ДокументОснование),ЭтаФорма);
КонецЕсли;


ТригерПриемаСканераШтрихКода=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
	ПодключитьОбработчикОжидания("АнализДанныхПослеОткрытия",0.1,Истина);
	КонецПроцедуры
&НаКлиенте
Процедура АнализДанныхПослеОткрытия()Экспорт 
	Если ТипЗнч(Параметры.ДанныеСканированнойЗадачи)=тип("Структура") тогда
		ОткрытиеОбластейРаботыСДанными(Параметры.ДанныеСканированнойЗадачи);
	КонецЕсли;
	КонецПроцедуры
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	 Если ИмяСобытия="ОбновлениеДанныхДинамическихСписков" и Источник=ОбщийМодульКлиентскойЧасти тогда
		//СлужебныеФункцииИПроцедурыКлиентСервер.ДобавитьВЛог(,"+#МоиЗадачи ОбновлениеДанныхДинамическихСписков");
		Элементы.СписокЗадач.Обновить();
		//СлужебныеФункцииИПроцедурыКлиентСервер.ДобавитьВЛог(,"-#МоиЗадачи ОбновлениеДанныхДинамическихСписков");
	КонецЕсли;
	Если ИмяСобытия="ОбработчикШтрихКода"  и ТригерПриемаСканераШтрихКода тогда
		Если Параметр=404 и Источник="ОшибкаЧтения" тогда
			ОбщийМодульКлиентскойЧасти.СообщитьЧерезФорму("Штрих код некорректен");
			Возврат
		КонецЕсли;	
		 ОбработчкаПолученияДанныхШтрихКода(Параметр);
	 КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ОбработчкаПолученияДанныхШтрихКода(ШтрихКод)
	СтруктураОтвета=СлужебныеФункцииИПроцедурыКлиентСервер.ПолучитьДанныеИзИтЗадачиТСД(ШтрихКод);
	
	Если СлужебныеФункцииИПроцедурыКлиентСервер.ТиповойОбработчикОшибок(СтруктураОтвета) тогда
		Возврат
	КонецЕсли;
	РезультатПроверки=ПроверкаНайденныхЗначений(СтруктураОтвета);
	Если РезультатПроверки.Количество()=1 тогда
		ОткрытиеОбластейРаботыСДанными(СтруктураОтвета[РезультатПроверки[0].Значение]);
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ОткрытиеОбластейРаботыСДанными(ДанныеЗадачи)
	Если ТипЗнч(ДанныеЗадачи.ДокументОснование)=Тип("ДокументСсылка.итПриемка") тогда
		ОткрытьФорму("Документ.итПриемка.Форма.ФормаДокумента",новый Структура("Ключ",ДанныеЗадачи.ДокументОснование),ЭтаФорма);
		ТригерПриемаСканераШтрихКода=Ложь;
	КонецЕсли;
	Если ТипЗнч(ДанныеЗадачи.ДокументОснование)=Тип("ДокументСсылка.итРазмещение") тогда
		ОткрытьФорму("Документ.итРазмещение.Форма.ФормаЗадачиДокумента",новый Структура("Ключ,ИдЗадачи,ОткрытиеСчитыванием",ДанныеЗадачи.ДокументОснование,ДанныеЗадачи.ИдЗадачи,Истина),ЭтаФорма);
		ТригерПриемаСканераШтрихКода=Ложь;
	КонецЕсли;
	Если ТипЗнч(ДанныеЗадачи.ДокументОснование)=Тип("ДокументСсылка.итПеремещение") тогда
		ОткрытьФорму("Документ.итПеремещение.Форма.ФормаЗадачиДокумента",новый Структура("Ключ,ИдЗадачи,ОткрытиеСчитыванием",ДанныеЗадачи.ДокументОснование,ДанныеЗадачи.ИдЗадачи,Истина),ЭтаФорма);
		ТригерПриемаСканераШтрихКода=Ложь;
	КонецЕсли;
	Если ТипЗнч(ДанныеЗадачи.ДокументОснование)=Тип("ДокументСсылка.итКонтрольнаяАгрегация") тогда
		ОткрытьФорму("Документ.итКонтрольнаяАгрегация.Форма.ФормаДокумента",новый Структура("Ключ",ДанныеЗадачи.ДокументОснование),ЭтаФорма);
		ТригерПриемаСканераШтрихКода=Ложь;
	КонецЕсли;
	Если ТипЗнч(ДанныеЗадачи.ДокументОснование)=Тип("ДокументСсылка.итНаборка") тогда
		ОткрытьФорму("Документ.итНаборка.Форма.ФормаДокумента",новый Структура("Ключ",ДанныеЗадачи.ДокументОснование),ЭтаФорма);
		ТригерПриемаСканераШтрихКода=Ложь;
	КонецЕсли;
    Если ТипЗнч(ДанныеЗадачи.ДокументОснование)=Тип("ДокументСсылка.итОтгрузка") тогда
		ОткрытьФорму("Документ.итОтгрузка.Форма.ФормаДокумента",новый Структура("Ключ",ДанныеЗадачи.ДокументОснование),ЭтаФорма);
		ТригерПриемаСканераШтрихКода=Ложь;
	КонецЕсли;
	Если ТипЗнч(ДанныеЗадачи.ДокументОснование)=Тип("ДокументСсылка.итПроверка") тогда
		ОткрытьФорму("Документ.итПроверка.Форма.ФормаДокумента",новый Структура("Ключ",ДанныеЗадачи.ДокументОснование),ЭтаФорма);
		ТригерПриемаСканераШтрихКода=Ложь;
	КонецЕсли;



КонецПроцедуры
&НаСервере
Функция ПроверкаНайденныхЗначений(СтруктураОтвета)
	
	
	СписокВыбора = новый СписокЗначений;
	для Каждого ПеречисленияДанных из Перечисления.итWMSТипыЗадачТСД цикл
		ПредставлениеТипаЗадачи=СлужебныеФункцииИПроцедурыКлиентСервер.ПредставлениеТипаЗадачиТСД(ПеречисленияДанных);
		Если СтруктураОтвета.Свойство(ПредставлениеТипаЗадачи) тогда
			СписокВыбора.Добавить(ПредставлениеТипаЗадачи);
		КонецЕсли;	
	КонецЦикла;
	Возврат СписокВыбора;
КонецФункции
&НаСервере
Функция ПолучитьТипЗадачи(ТипЗадачи)
	Возврат Перечисления.итWMSТипыЗадачТСД[ТипЗадачи];
	КонецФункции
